---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCLogical
source: html/8d4718f4-4968-b70d-0fb1-a5a153e7d699.htm
---
# Autodesk.Revit.DB.IFC.IFCLogical

A datatype can have values TRUE, FALSE, UNKNOWN or UNSET.

## Syntax (C#)
```csharp
public enum IFCLogical
```